<!DOCTYPE html>

<head>
    <title>Проверка адреса на попадание в зону доставки</title>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <!--
        Укажите свой API-ключ. Тестовый ключ НЕ БУДЕТ работать на других сайтах.
        Получить ключ можно в Кабинете разработчика: https://developer.tech.yandex.ru/keys/
    -->
{{--    <script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU&amp;coordorder=longlat&amp;apikey=095951de-4816-452f-a0e6-88012bd7263e" type="text/javascript"></script>--}}
{{--    <script src="delivery_zones.js" type="text/javascript"></script>--}}
    <script type="text/javascript" src="https://yandex.st/jquery/2.2.3/jquery.js"></script>
    <style type="text/css">
        html, body, #map {
            width: 100%;
            height: 100%;
            padding: 0;
            margin: 0;
        }
    </style>
</head>
<body>
<input name="address" autocomplete="off" class="address_input js_calculation_map_input" id="ORDER_PROP_2" placeholder="адрес доставки *" data-format=".+" data-notice="Введите адрес доставки" type="text" value="">
<div id="map" style="width: 100%;height: 500px;"></div>


<script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU&onload=fid_33301333&coordorder=longlat"></script>
<textarea id="logarea" style="width: 100%; height: 300px; background-color: aqua"></textarea>
<script>

    window.order_obj = {
        geo: false,

        check_address: function() {
            $self = $(".js_calculation_map_input");
            address = $self.val()
            if(address.length > 4){
//запрашиваем координату
                ymaps.geocode("Иркутск, "+address).then(function(res){
                    //если пришел ответ:
                    if (res.geoObjects.get(0)) {
                        //удаляем старую координату
                        if (order_obj.geo) {
                            map.geoObjects.remove(order_obj.geo)
                        }
                        //тут обрабатываем полученную точку
                        order_obj.geo = res.geoObjects.get(0);
                        //добавляем на карту
                        map.geoObjects.add(order_obj.geo)
                        //получаем координаты
                        coords = order_obj.geo.geometry.getCoordinates();
                        //устанавливаем центр карты
                        map.setCenter(coords)
                        //настройка зума
                        map.setZoom(16)
                        // alert(123);
                        var minDeliverySum = 0;
                        map.geoObjects.each(function(r){
                            if(r.geometry && r.geometry._coordPath && r.geometry._coordPath._coordinates && r.geometry.contains(coords)){
                                if(r.properties && r.properties._data && r.properties._data.balloonContent){
                                	var text = r.properties._data.balloonContent;
                                	var str = '';
                                	if(text){str = text.replace('Бесплатная доставка от ', '');}
	                                if(str){minDeliverySum = parseInt(str);}
                                }
                            }
                        });
                        if(minDeliverySum>0){
                            console.log('Минимальная сумма доставки в эту зону:'+minDeliverySum+" руб.");
                        }else{
                            console.log('Доставка в выбранную зону не осуществляется');
                        }


                    }
                })
            }
        }
    }

    $(".js_calculation_map_input").change(function() {
        order_obj.check_address();
    });
    $(".js_calculation_map_input").keyup(function() {
        order_obj.check_address();
    });


    var objects = [];
    var events = {};
    var map;


function fid_33301333(ymaps) {
    // alert("Обрабатываем карту");

    try{}catch(e){alert(e);}
    objects["map"] = map = new ymaps.Map(
        "map",
        {
            center: [104.280660,52.296387],
            zoom: 11,
            type: "yandex#map",
            controls:[],
            behaviors:['scrollZoom','drag','dblClickZoom']
        }
    );
    //далее попробуем отрисовать многоугольник:
    let zone_1000 = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                zone_1000_coordinates
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContent: "Бесплатная доставка от 1000 рублей"
        }},{
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#00FF00',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.5,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        // strokeStyle: 'shortdash'
    });

    let zone_500 = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                zone_500_coordinates
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContent: "Бесплатная доставка от 500 рублей"
        }},{
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FF0000',
        // Цвет обводки.
        strokeColor: '#FF0000',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.5,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        // strokeStyle: 'shortdash'
    });

    let zone_800 = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
                zone_800_coordinates
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContent: "Бесплатная доставка от 800 рублей"
        }},{
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#FF9D32',
        // Цвет обводки.
        strokeColor: '#FF9D32',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.5,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        // strokeStyle: 'shortdash'
    });

    map.geoObjects.add(zone_1000);
    map.geoObjects.add(zone_500);
    map.geoObjects.add(zone_800);




    //order_obj.check_address();
}


function LOG(text){
    document.querySelector('#logarea').innerHTML=text;
}



let zone_1000_coordinates = [
    [104.11516466546863, 52.36156443729239],
    [104.1321737357132,52.36547188690466],
    [104.18125634815533,52.3529526291164],
    [104.19383675888105,52.342677390752925],
    [104.20514326196044,52.350617663296504],
    [104.20753629576492,52.36015678523825],
    [104.19241050174654,52.366973106806086],
    [104.1992560466626,52.37715004438561],
    [104.22130833461681,52.37737506484168],
    [104.25566786740828,52.366049785197454],
    [104.2736331712615,52.35014560954394],
    [104.26823093121872,52.33394410133725],
    [104.2742869151996,52.31811167626564],
    [104.26523457344334,52.31195466332153],
    [104.25413333805511,52.29970298408447],
    [104.25067518633091,52.29861864941089],
    [104.21625861710068,52.29444471514074],
    [104.2077798781298,52.308935459694524],
    [104.11516466546863,52.36156443729239]
];

let zone_500_coordinates = [
    [104.17917100949722, 52.2573394757548],
    [104.1836187703028, 52.2598837743059],
    [104.19002190150944, 52.26104145674902],
    [104.18641556461662, 52.2643081803098],
    [104.19305972031013, 52.267278427179825],
    [104.19408968857181, 52.265777616082126],
    [104.19689500437694, 52.26725034164416],
    [104.19145757192629, 52.27341439264558],
    [104.19623144800445, 52.27669159979153],
    [104.20226758467405, 52.28333712075397],
    [104.20786168941346, 52.2797760814776],
    [104.22089729456434, 52.28166229916805],
    [104.22790770028708, 52.283910880057626],
    [104.23522771363415, 52.29081038865494],
    [104.2407565268016, 52.2948499482811],
    [104.26638461677507, 52.29822838330568],
    [104.27308399775896, 52.29779539364029],
    [104.26100015849734, 52.29107999712741],
    [104.26127289591622, 52.288542424098125],
    [104.28621605735917, 52.25016628481171],
    [104.28519941200427, 52.24458675148984],
    [104.26641260276767, 52.23836553308716],
    [104.26578941093386, 52.24238450443071],
    [104.26718898448641, 52.24387179086638],
    [104.26321405378116, 52.24839187905746],
    [104.25439876157986, 52.25036701776253],
    [104.25329470900292, 52.24861981445831],
    [104.24917187827006, 52.249428004095016],
    [104.24609421585458, 52.24858132381089],
    [104.244686643807, 52.24893898905856],
    [104.2432275221029, 52.25007161672221],
    [104.23781304300405, 52.24915185371187],
    [104.2278703400527, 52.246115293089034],
    [104.21986206756546, 52.243059861346055],
    [104.2044276923238, 52.25231733957392],
    [104.19419309798846, 52.24732894979895],
    [104.17917100949722, 52.2573394757548]
];
let zone_800_coordinates = [
    [104.32964017251159, 52.326951026549885],
    [104.32766606667664, 52.313854696197005],
    [104.33745076516296, 52.31401250649392],
    [104.33848073342469, 52.30822575916489],
    [104.33976819375184, 52.29996517550311],
    [104.35796429970887, 52.30080708930649],
    [104.36005312180792, 52.27431279856156],
    [104.37515932297983, 52.2655192475782],
    [104.389537445447, 52.2550426368659],
    [104.37770220103603, 52.24627867020026],
    [104.36134460221223, 52.24556322133165],
    [104.34783073687593, 52.242949322148625],
    [104.33568312171482, 52.24698780059283],
    [104.31813375697918, 52.230332787298906],
    [104.33373272582179, 52.22066336065612],
    [104.32433605612933, 52.21278741596948],
    [104.31691170157612, 52.21178564545236],
    [104.3095302623671, 52.20593274285871],
    [104.291325574315, 52.212500697980566],
    [104.2921331373803, 52.20587059207157],
    [104.27278463320599, 52.20417962554995],
    [104.25997440295086, 52.20603847526892],
    [104.27602057678658, 52.224745576172154],
    [104.26014548386101, 52.23065940135263],
    [104.26666893995659, 52.23785478676432],
    [104.28651435085699, 52.244844877239764],
    [104.28753672571642, 52.250386694729606],
    [104.27431514302152, 52.27037260510123],
    [104.26558269973232, 52.28890399376182],
    [104.27215759980643, 52.29213855887275],
    [104.28732194024198, 52.29464995946081],
    [104.29256927937512, 52.30018580275272],
    [104.285654975478, 52.31360556033013],
    [104.28356739238346, 52.32279459984977],
    [104.29416193062222, 52.32795355842655],
    [104.32964017251159, 52.326951026549885]
]


</script>
</body>
</html>


<script>
    //Скрипт для создания карты
    // https://tech.yandex.ru/maps/jsbox/2.1/polygonEditor
    // ymaps.ready(init);
    //
    // ymaps.ready(init);
    //
    // function init() {
    //     var myMap = new ymaps.Map("map", {
    //         center: [104.14950335749269,52.241188182770614],
    //         zoom: 10
    //     }, {
    //         searchControlProvider: 'yandex#search'
    //     });
    //
    //     // Создаем многоугольник без вершин.
    //     var myPolygon = new ymaps.Polygon([], {}, {
    //         // Курсор в режиме добавления новых вершин.
    //         editorDrawingCursor: "crosshair",
    //         // Максимально допустимое количество вершин.
    //         editorMaxPoints: 37,
    //         // Цвет заливки.
    //         fillColor: '#FF0000',
    //         // Цвет обводки.
    //         strokeColor: '#0000FF',
    //         // Ширина обводки.
    //         opacity: 0.3,
    //         strokeWidth: 5
    //     });
    //     // Добавляем многоугольник на карту.
    //     myMap.geoObjects.add(myPolygon);
    //
    //     console.log(myPolygon.geometry._coordPath);
    //
    //     // В режиме добавления новых вершин меняем цвет обводки многоугольника.
    //     var stateMonitor = new ymaps.Monitor(myPolygon.editor.state);
    //     stateMonitor.add("drawing", function (newValue) {
    //         myPolygon.options.set("strokeColor", newValue ? '#FF0000' : '#0000FF');
    //     });
    //
    //     // Включаем режим редактирования с возможностью добавления новых вершин.
    //     myPolygon.editor.startDrawing();
    // }


</script>
